       IDENTIFICATION DIVISION.
       PROGRAM-ID. UMSATZ-RECHNER.
       AUTHOR. NOEL LANG.
       DATE-WRITTEN. 2022-SEP-17.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BUCHUNGEN
               ASSIGN TO "BUCHUNGEN.DAT"
                   ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
           FD BUCHUNGEN.
           01 BUCHUNG.
               02 MITARBEITER-NAME.
                   03 MITARBEITER-VORNAME  PIC X(10).
                   03 MITARBEITER-NACHNAME PIC X(10).
               02 ANZAHL-STUNDEN PIC 9(3).
       WORKING-STORAGE SECTION.
           01 FIRMA-STUNDENSATZ PIC 9(3) VALUE IS 150.
           01 GESAMT-UMSATZ PIC 9(6)V99.
           01 FORMAT-UMSATZ-PRO-MITARBEITER.
               02 PRINT-MITARBEITER-NAME   PIC X(20).
               02 FILLER                   PIC X.
               02 PRINT-ANZAHL-STUNDEN     PIC 9(3).
               02 FILLER                   PIC X.
               02 PRINT-MENGE-UMSATZ       PIC $***,***.99.
           01 END-FILE PIC X.
               88  EOF VALUE "T".
       PROCEDURE DIVISION.
       BEGIN.
           PERFORM INITIALIZE-PROGRAM.
           PERFORM PROCESS-LINE WITH TEST BEFORE UNTIL EOF.
           PERFORM CLEAN-UP.
           STOP RUN.
       INITIALIZE-PROGRAM.
           OPEN INPUT BUCHUNGEN.
       PROCESS-LINE.
           READ BUCHUNGEN INTO BUCHUNG
               AT END MOVE "T" TO END-FILE.
           IF NOT EOF THEN
               PERFORM BERECHNE-GESAMTUMSATZ
               PERFORM PRINT-UMSATZ-PRO-MITARBEITER
           END-IF.
       BERECHNE-GESAMTUMSATZ.
           COMPUTE GESAMT-UMSATZ = ANZAHL-STUNDEN * FIRMA-STUNDENSATZ.
       PRINT-UMSATZ-PRO-MITARBEITER.
           MOVE MITARBEITER-NAME  TO PRINT-MITARBEITER-NAME.
           MOVE ANZAHL-STUNDEN    TO PRINT-ANZAHL-STUNDEN.
           MOVE GESAMT-UMSATZ     TO PRINT-MENGE-UMSATZ.
           DISPLAY FORMAT-UMSATZ-PRO-MITARBEITER.
       CLEAN-UP.
           CLOSE BUCHUNGEN.
       END PROGRAM UMSATZ-RECHNER.
